Ran Plan for 2 projects:

1. dir: `vpc-demo-2` workspace: `default`
1. dir: `vpc-demo` workspace: `default`

### 1. dir: `vpc-demo-2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Project VPC IGW Demo2"
        }
      + tags_all = {
          + "Name" = "Project VPC IGW Demo2"
        }
      + vpc_id   = "vpc-0fcbb8f3f98eafcc7"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-2`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `vpc-demo` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be destroyed
  # (because aws_internet_gateway.gw is not in configuration)
- resource "aws_internet_gateway" "gw" {
      - arn      = "arn:aws:ec2:us-east-1:630209571978:internet-gateway/igw-04f42388a917aeb9e" -> null
      - id       = "igw-04f42388a917aeb9e" -> null
      - owner_id = "630209571978" -> null
      - tags     = {
          - "Name" = "Project VPC IGW Demo"
        } -> null
      - tags_all = {
          - "Name" = "Project VPC IGW Demo"
        } -> null
      - vpc_id   = "vpc-038de61bc566c92be" -> null
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`